[
  {
    "id": "e7t4",
    "recipe_name": "Roasted Chicken and Vegetables",
    "category_id": 1,
    "image_link": "https://www.cookingclassy.com/wp-content/uploads/2018/01/roasted-chicken-veggies-herb-vinaigrette-7.jpg",
    "ingredients": [
      "1 whole chicken, about 3-4 pounds",
      "3 tablespoons olive oil",
      "2 teaspoons salt",
      "1 teaspoon black pepper",
      "2 cups baby potatoes, halved",
      "2 cups baby carrots",
      "2 cups brussels sprouts, halved",
      "1 lemon, sliced",
      "1 onion, sliced"
    ],
    "cooking_method": [
      "1. Preheat oven to 425°F.",
      "2. Rinse chicken and pat dry. Rub chicken with 1 tablespoon olive oil and season with 1 teaspoon salt and 1/2 teaspoon black pepper.",
      "3. In a large bowl, toss potatoes, carrots, brussels sprouts, lemon, onion, remaining 2 tablespoons olive oil, 1 teaspoon salt, and 1/2 teaspoon black pepper.",
      "4. Arrange vegetables in a single layer on a baking sheet. Place chicken on top of the vegetables.",
      "5. Roast for 1 hour to 1 hour 15 minutes, or until chicken is cooked through and vegetables are tender.",
      "6. Let chicken rest for 10 minutes before carving. Serve chicken and vegetables together."
    ],
    "rating": 4.8
  },

  {
    "id": "a3f8",
    "recipe_name": "Classic Cheeseburger",
    "category_id": 3,
    "image_link": "https://i.postimg.cc/vHT3qK07/download.jpg",
    "ingredients": [
      "1 lb ground beef",
      "4 slices cheddar cheese",
      "4 hamburger buns",
      "1/2 teaspoon salt",
      "1/4 teaspoon black pepper",
      "1/4 teaspoon garlic powder",
      "1 tablespoon vegetable oil",
      "4 leaves lettuce",
      "4 slices tomato",
      "4 slices red onion"
    ],
    "cooking_method": [
      "1. Preheat grill or grill pan to medium-high heat.",
      "2. In a large bowl, combine ground beef, salt, pepper, and garlic powder. Mix well and form into 4 patties.",
      "3. Brush vegetable oil on both sides of each patty.",
      "4. Grill patties for 4-5 minutes per side, or until fully cooked.",
      "5. During the last minute of cooking, place a slice of cheddar cheese on each patty to melt.",
      "6. Toast hamburger buns on the grill for 1-2 minutes.",
      "7. Assemble the burgers by placing a patty on each bun bottom, followed by a lettuce leaf, tomato slice, and red onion slice. Top with the bun top and serve."
    ],
    "rating": 4.5
  },

  {
    "id": "m9t7",
    "recipe_name": "Macaroni and Cheese",
    "category_id": 3,
    "image_link": "https://i.postimg.cc/sgHLVh2W/download-1.jpg",
    "ingredients": [
      "1 pound elbow macaroni",
      "1/4 cup unsalted butter",
      "1/4 cup all-purpose flour",
      "3 cups whole milk",
      "2 cups grated cheddar cheese",
      "1 cup grated Gruyere cheese",
      "1/2 cup grated Parmesan cheese",
      "1/4 teaspoon cayenne pepper",
      "1/4 teaspoon black pepper",
      "1/4 teaspoon salt",
      "1/4 cup breadcrumbs"
    ],
    "cooking_method": [
      "1. Preheat oven to 350°F. Grease a 9x13 inch baking dish.",
      "2. Cook macaroni according to package instructions until al dente. Drain and set aside.",
      "3. In a large saucepan, melt butter over medium heat. Add flour and stir constantly for 1-2 minutes.",
      "4. Slowly whisk in milk and continue to stir until mixture is smooth.",
      "5. Add cheddar, Gruyere, and Parmesan cheeses to the saucepan, stirring constantly until cheese is melted and mixture is smooth.",
      "6. Add cayenne pepper, black pepper, and salt to the saucepan and stir to combine.",
      "7. Add cooked macaroni to the cheese sauce and stir until macaroni is evenly coated.",
      "8. Pour mixture into prepared baking dish and sprinkle breadcrumbs on top.",
      "9. Bake for 25-30 minutes, or until top is golden brown and crispy.",
      "10. Remove from oven and let cool for 5-10 minutes before serving."
    ],
    "rating": 4.7
  },
  {
    "id": "c4t6",
    "recipe_name": "Chicken Pot Pie",
    "category_id": 4,
    "image_link": "https://i.postimg.cc/kgN5z7ML/OIP-2.jpg",
    "ingredients": [
      "1 pound boneless, skinless chicken breasts, cut into bite-sized pieces",
      "2 cups frozen mixed vegetables (peas, carrots, green beans, corn)",
      "1/2 cup unsalted butter",
      "1/2 cup all-purpose flour",
      "1/2 teaspoon salt",
      "1/4 teaspoon black pepper",
      "1/4 teaspoon garlic powder",
      "1 3/4 cups chicken broth",
      "2/3 cup milk",
      "2 unbaked 9-inch pie crusts"
    ],
    "cooking_method": [
      "1. Preheat oven to 425°F.",
      "2. In a large skillet, cook chicken until no longer pink. Add mixed vegetables and cook for 5 more minutes.",
      "3. In a separate saucepan, melt butter over medium heat. Stir in flour, salt, black pepper, and garlic powder until well blended.",
      "4. Gradually whisk in chicken broth and milk, stirring constantly, until sauce has thickened.",
      "5. Pour sauce over chicken mixture and stir to combine.",
      "6. Line a 9-inch pie dish with one pie crust. Pour in chicken mixture. Cover with second pie crust, crimping edges to seal.",
      "7. Cut a few slits in the top crust to allow steam to escape.",
      "8. Bake for 30-35 minutes, or until crust is golden brown and filling is hot and bubbly.",
      "9. Let cool for 10 minutes before serving."
    ],
    "rating": 4.7
  },
  {
    "id": "r1t9",
    "recipe_name": "BBQ Ribs",
    "category_id": 5,
    "image_link": "https://i.postimg.cc/d1GvkB7p/download-2.jpg",
    "ingredients": [
      "3 pounds baby back ribs",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "2 teaspoons paprika",
      "1/2 teaspoon cayenne pepper",
      "1 cup BBQ sauce"
    ],
    "cooking_method": [
      "1. Preheat oven to 275°F.",
      "2. Season ribs with garlic powder, onion powder, paprika, and cayenne pepper.",
      "3. Wrap ribs tightly in aluminum foil and place on a baking sheet.",
      "4. Bake ribs for 2 1/2 to 3 hours, or until tender.",
      "5. Remove ribs from foil and place on a preheated grill.",
      "6. Brush ribs with BBQ sauce and grill for 5 to 10 minutes on each side, or until caramelized and lightly charred.",
      "7. Serve hot with additional BBQ sauce, if desired."
    ],
    "rating": 4.9
  },
  {
    "id": "b5r7",
    "recipe_name": "Beef Burger",
    "category_id": 6,
    "image_link": "https://i.postimg.cc/2Sd4GpsS/OIP-3.jpg",
    "ingredients": [
      "1 pound ground beef",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "4 hamburger buns",
      "4 slices cheddar cheese",
      "Lettuce, tomato, and onion slices (optional)"
    ],
    "cooking_method": [
      "1. Preheat grill or grill pan to high heat.",
      "2. Divide ground beef into four portions and form into patties, being careful not to overwork the meat.",
      "3. Season patties with salt and pepper on both sides.",
      "4. Grill burgers for 3 to 4 minutes on each side, or until desired doneness is reached.",
      "5. During the last minute of cooking, place a slice of cheddar cheese on each burger and cover the grill to melt the cheese.",
      "6. Toast hamburger buns on the grill for a few seconds on each side.",
      "7. Assemble burgers with lettuce, tomato, and onion slices (if using).",
      "8. Serve hot."
    ],
    "rating": 4.7
  },
  {
    "id": "m8g2",
    "recipe_name": "Baked Mac and Cheese",
    "category_id": 1,
    "image_link": "https://i.postimg.cc/zBHwnL59/Baked-Mac-and-Cheese.jpg",
    "ingredients": [
      "1 pound elbow macaroni",
      "6 tablespoons unsalted butter",
      "6 tablespoons all-purpose flour",
      "3 cups whole milk",
      "1 cup heavy cream",
      "1 teaspoon kosher salt",
      "1/2 teaspoon black pepper",
      "1/4 teaspoon cayenne pepper",
      "4 cups shredded cheddar cheese",
      "1 cup panko breadcrumbs",
      "1/4 cup grated Parmesan cheese"
    ],
    "cooking_method": [
      "1. Preheat oven to 375°F.",
      "2. Cook macaroni in a large pot of boiling salted water until al dente. Drain and set aside.",
      "3. In a large saucepan, melt butter over medium heat. Add flour and whisk constantly for 1 minute.",
      "4. Gradually whisk in milk and cream, and bring to a simmer. Cook, whisking frequently, until sauce thickens, about 5 minutes.",
      "5. Add salt, black pepper, and cayenne pepper, and stir to combine.",
      "6. Remove from heat and stir in cheddar cheese until melted and smooth.",
      "7. Add cooked macaroni to the sauce and stir to combine. Pour into a 9x13-inch baking dish.",
      "8. In a small bowl, mix together panko breadcrumbs and Parmesan cheese. Sprinkle over the top of the macaroni and cheese.",
      "9. Bake for 25-30 minutes, or until top is golden brown and crispy. Let cool for 5 minutes before serving."
    ],
    "rating": 4.5
  },
  {
    "id": "a2b9",
    "recipe_name": "BBQ Pulled Pork Sandwich",
    "category_id": 2,
    "image_link": "https://i.postimg.cc/52FxWb4f/BBQ-Pulled-Pork-Sandwich.jpg",
    "ingredients": [
      "3-4 lbs pork shoulder",
      "1 tbsp paprika",
      "1 tbsp garlic powder",
      "1 tbsp onion powder",
      "1 tbsp brown sugar",
      "1 tsp salt",
      "1 tsp black pepper",
      "2 cups BBQ sauce",
      "8 hamburger buns"
    ],
    "cooking_method": [
      "1. Mix together paprika, garlic powder, onion powder, brown sugar, salt, and black pepper.",
      "2. Rub the spice mixture all over the pork shoulder.",
      "3. Place the pork in a slow cooker and add 1 cup of BBQ sauce.",
      "4. Cook on low for 8 hours or high for 4 hours.",
      "5. Remove the pork from the slow cooker and shred it with two forks.",
      "6. Discard any excess fat and return the shredded pork to the slow cooker with the remaining 1 cup of BBQ sauce.",
      "7. Cook on high for an additional 30 minutes.",
      "8. Serve the pulled pork on hamburger buns."
    ],
    "rating": 4.6
  },
  {
    "id": "k2j6",
    "recipe_name": "New York-Style Pizza",
    "category_id": 2,
    "image_link": "https://i.postimg.cc/Pq9Vsnqn/New-York-Style-Pizza.jpg",
    "ingredients": [
      "1 1/4 cups warm water",
      "1 tablespoon sugar",
      "2 1/4 teaspoons active dry yeast",
      "3 1/2 cups bread flour",
      "2 tablespoons extra-virgin olive oil",
      "1 1/2 teaspoons salt",
      "1 (28-ounce) can whole peeled tomatoes",
      "1 tablespoon extra-virgin olive oil",
      "1 teaspoon dried oregano",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon red pepper flakes",
      "12 ounces low-moisture mozzarella cheese, grated",
      "2 tablespoons finely grated Parmesan cheese",
      "1/4 cup chopped fresh basil leaves"
    ],
    "cooking_method": [
      "1. In a large bowl, stir together the water, sugar, and yeast. Let sit for 5 minutes, or until the mixture becomes foamy.",
      "2. Add the flour, olive oil, and salt to the bowl with the yeast mixture. Mix with a wooden spoon until the dough comes together.",
      "3. Turn the dough out onto a lightly floured surface and knead for 5-10 minutes, or until the dough becomes smooth and elastic.",
      "4. Place the dough in a lightly oiled bowl, cover with plastic wrap, and let rise in a warm place for 1-2 hours, or until doubled in size.",
      "5. Preheat the oven to 500°F.",
      "6. In a blender or food processor, puree the tomatoes until smooth. Add the olive oil, oregano, garlic powder, and red pepper flakes, and pulse to combine.",
      "7. Roll out the pizza dough into a large circle or rectangle, depending on your preference. Transfer the dough to a baking sheet or pizza stone.",
      "8. Spread the tomato sauce over the pizza dough, leaving a 1-inch border around the edges.",
      "9. Sprinkle the mozzarella and Parmesan cheese over the sauce.",
      "10. Bake the pizza for 10-12 minutes, or until the crust is golden brown and the cheese is melted and bubbly.",
      "11. Remove the pizza from the oven and sprinkle with chopped basil. Slice and serve immediately."
    ],
    "rating": 4.9
  },
  {
    "id": "u6f9",
    "recipe_name": "Fried Chicken",
    "category_id": 4,
    "image_link": "https://i.postimg.cc/bY3bsHQs/Fried-Chicken.jpg",
    "ingredients": [
      "1 whole chicken, cut into 8 pieces",
      "2 cups buttermilk",
      "2 teaspoons salt",
      "1 teaspoon paprika",
      "1/2 teaspoon cayenne pepper",
      "2 cups all-purpose flour",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "1 tablespoon black pepper",
      "1 quart vegetable oil, for frying"
    ],
    "cooking_method": [
      "1. In a large bowl, whisk together buttermilk, 1 teaspoon salt, paprika, and cayenne pepper. Add chicken pieces, making sure each piece is fully coated. Cover and refrigerate for at least 4 hours, or overnight.",
      "2. In a shallow dish, whisk together flour, garlic powder, onion powder, black pepper, and remaining 1 teaspoon salt.",
      "3. Remove chicken from buttermilk mixture and let excess liquid drip off. Dredge chicken in flour mixture, shaking off excess.",
      "4. In a large Dutch oven or deep fryer, heat vegetable oil over medium-high heat to 350°F.",
      "5. Add chicken to the hot oil, being careful not to overcrowd the pot. Fry for 12-15 minutes, or until golden brown and cooked through.",
      "6. Use a slotted spoon to transfer chicken to a wire rack set over a baking sheet to drain excess oil. Let cool for a few minutes before serving."
    ],
    "rating": 4.9
  },
  {
    "id": "k5s2",
    "recipe_name": "New England Clam Chowder",
    "category_id": 5,
    "image_link": "https://i.postimg.cc/bY7gRf6K/New-England-Clam-Chowder.jpg",
    "ingredients": [
      "4 tablespoons unsalted butter",
      "1 medium onion, diced",
      "2 cloves garlic, minced",
      "4 slices bacon, chopped",
      "1/4 cup all-purpose flour",
      "4 cups clam juice",
      "1 pound Yukon Gold potatoes, peeled and diced",
      "2 cups heavy cream",
      "2 bay leaves",
      "1 pound fresh clams, shucked, juices reserved",
      "Salt and black pepper, to taste"
    ],
    "cooking_method": [
      "1. Melt the butter in a large pot over medium heat. Add the onion, garlic, and bacon and cook, stirring occasionally, until the onion is translucent and the bacon is crisp, about 10 minutes.",
      "2. Sprinkle the flour over the onion mixture and stir until the flour is absorbed, about 2 minutes.",
      "3. Gradually whisk in the clam juice, making sure there are no lumps. Add the potatoes, cream, and bay leaves and bring to a simmer.",
      "4. Simmer until the potatoes are tender, about 15 minutes.",
      "5. Add the clams and their juices and cook until the clams are just heated through, about 5 minutes.",
      "6. Season the chowder with salt and pepper, and discard the bay leaves. Serve hot."
    ],
    "rating": 4.9
  },
  {
    "id": "p8f6",
    "recipe_name": "Philly Cheesesteak",
    "category_id": 6,
    "image_link": "https://i.postimg.cc/ydS9JkzW/Philly-Cheesesteak.jpg",
    "ingredients": [
      "1 pound ribeye steak, thinly sliced",
      "4 sub rolls",
      "1 large onion, thinly sliced",
      "1 large green bell pepper, thinly sliced",
      "8 slices provolone cheese",
      "2 tablespoons olive oil",
      "1/2 teaspoon kosher salt",
      "1/4 teaspoon black pepper"
    ],
    "cooking_method": [
      "1. Heat a large skillet over high heat. Add the olive oil and swirl to coat.",
      "2. Add the sliced onion and green pepper and cook, stirring occasionally, until softened, about 5 minutes.",
      "3. Push the vegetables to one side of the skillet and add the sliced ribeye. Cook, stirring occasionally, until browned and cooked through, about 5 minutes.",
      "4. Season the steak with salt and black pepper.",
      "5. Top the steak with the provolone cheese and let it melt, about 1 minute.",
      "6. Divide the steak and vegetable mixture evenly among the sub rolls.",
      "7. Serve hot."
    ],
    "rating": 4.7
  },
  {
    "id": "m5p7",
    "recipe_name": "Beef Chili",
    "category_id": 1,
    "image_link": "https://i.postimg.cc/nV3ZsT0j/Beef-Chili.jpg,",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "2 pounds ground beef",
      "1 onion, chopped",
      "1 green bell pepper, chopped",
      "2 cloves garlic, minced",
      "2 tablespoons chili powder",
      "1 tablespoon ground cumin",
      "1 teaspoon smoked paprika",
      "1/2 teaspoon cayenne pepper",
      "1 can (28 ounces) crushed tomatoes",
      "1 can (15 ounces) kidney beans, drained and rinsed",
      "1 can (15 ounces) pinto beans, drained and rinsed",
      "1 cup beef broth",
      "Salt and black pepper to taste"
    ],
    "cooking_method": [
      "1. Heat oil in a large pot over medium-high heat. Add ground beef and cook until browned, stirring occasionally.",
      "2. Add onion, bell pepper, and garlic to the pot and cook until vegetables are softened, about 5 minutes.",
      "3. Stir in chili powder, cumin, smoked paprika, and cayenne pepper and cook for 1 minute.",
      "4. Add crushed tomatoes, kidney beans, pinto beans, and beef broth to the pot and stir to combine.",
      "5. Bring mixture to a simmer and cook for 30 minutes, stirring occasionally.",
      "6. Season with salt and black pepper to taste. Serve hot with your favorite toppings."
    ],
    "rating": 4.7
  },
  {
    "id": "h6f2",
    "recipe_name": "Bacon Mac and Cheese",
    "category_id": 2,
    "image_link": "https://i.postimg.cc/bYZ8tkMm/Bacon-Mac-and-Cheese.jpg",
    "ingredients": [
      "1 lb elbow macaroni",
      "8 slices bacon",
      "4 tbsp unsalted butter",
      "1/4 cup all-purpose flour",
      "2 cups whole milk",
      "1 cup heavy cream",
      "1 tsp garlic powder",
      "1 tsp onion powder",
      "1 tsp dry mustard",
      "1/2 tsp paprika",
      "1/2 tsp cayenne pepper",
      "2 cups shredded cheddar cheese",
      "1 cup shredded Gruyere cheese",
      "1/2 cup panko bread crumbs"
    ],
    "cooking_method": [
      "1. Preheat oven to 375°F.",
      "2. Cook elbow macaroni in a large pot of salted boiling water until al dente. Drain and set aside.",
      "3. Cook bacon in a large skillet until crisp. Remove from skillet and crumble.",
      "4. Melt butter in a large saucepan over medium heat. Add flour and whisk until smooth.",
      "5. Add milk and heavy cream, whisking constantly until smooth.",
      "6. Add garlic powder, onion powder, dry mustard, paprika, and cayenne pepper. Whisk until well combined.",
      "7. Add shredded cheddar cheese and shredded Gruyere cheese. Whisk until cheese is melted and sauce is smooth.",
      "8. Add cooked macaroni and crumbled bacon to cheese sauce. Stir until well combined.",
      "9. Pour mac and cheese mixture into a 9x13 inch baking dish. Top with panko bread crumbs.",
      "10. Bake for 25-30 minutes, or until panko bread crumbs are golden brown and mac and cheese is bubbly.",
      "11. Let cool for 5 minutes before serving."
    ],
    "rating": 4.9
  },
  {
    "id": "d5k8",
    "recipe_name": "BBQ Pork Ribs",
    "category_id": 3,
    "image_link": "https://i.postimg.cc/8z5bpksf/BBQ-Pork-Ribs.jpg",
    "ingredients": [
      "3 lbs pork spare ribs",
      "1 cup barbecue sauce",
      "1/4 cup brown sugar",
      "1/4 cup apple cider vinegar",
      "1 tbsp paprika",
      "1 tsp garlic powder",
      "1 tsp onion powder",
      "1 tsp salt",
      "1/2 tsp black pepper"
    ],
    "cooking_method": [
      "1. Preheat oven to 300°F.",
      "2. Place ribs on a large baking sheet.",
      "3. In a small bowl, mix together barbecue sauce, brown sugar, apple cider vinegar, paprika, garlic powder, onion powder, salt, and black pepper.",
      "4. Brush ribs generously with sauce mixture on both sides.",
      "5. Cover the baking sheet with aluminum foil and bake for 2-2 1/2 hours, or until the meat is tender and cooked through.",
      "6. Remove the foil and brush ribs with additional sauce.",
      "7. Broil on high for 3-5 minutes, or until sauce is caramelized and sticky.",
      "8. Let ribs rest for 10 minutes before cutting and serving."
    ],
    "rating": 4.5
  },
  {
    "id": "a3f8",
    "recipe_name": "Classic Cheeseburger",
    "category_id": 4,
    "image_link": "https://i.postimg.cc/vHT3qK07/download.jpg",
    "ingredients": [
      "1 lb ground beef",
      "4 slices cheddar cheese",
      "4 hamburger buns",
      "1/2 teaspoon salt",
      "1/4 teaspoon black pepper",
      "1/4 teaspoon garlic powder",
      "1 tablespoon vegetable oil",
      "4 leaves lettuce",
      "4 slices tomato",
      "4 slices red onion"
    ],
    "cooking_method": [
      "1. Preheat grill or grill pan to medium-high heat.",
      "2. In a large bowl, combine ground beef, salt, pepper, and garlic powder. Mix well and form into 4 patties.",
      "3. Brush vegetable oil on both sides of each patty.",
      "4. Grill patties for 4-5 minutes per side, or until fully cooked.",
      "5. During the last minute of cooking, place a slice of cheddar cheese on each patty to melt.",
      "6. Toast hamburger buns on the grill for 1-2 minutes.",
      "7. Assemble the burgers by placing a patty on each bun bottom, followed by a lettuce leaf, tomato slice, and red onion slice. Top with the bun top and serve."
    ],
    "rating": 4.5
  },

  {
    "id": "m9t7",
    "recipe_name": "Macaroni and Cheese",
    "category_id": 5,
    "image_link": "https://i.postimg.cc/sgHLVh2W/download-1.jpg",
    "ingredients": [
      "1 pound elbow macaroni",
      "1/4 cup unsalted butter",
      "1/4 cup all-purpose flour",
      "3 cups whole milk",
      "2 cups grated cheddar cheese",
      "1 cup grated Gruyere cheese",
      "1/2 cup grated Parmesan cheese",
      "1/4 teaspoon cayenne pepper",
      "1/4 teaspoon black pepper",
      "1/4 teaspoon salt",
      "1/4 cup breadcrumbs"
    ],
    "cooking_method": [
      "1. Preheat oven to 350°F. Grease a 9x13 inch baking dish.",
      "2. Cook macaroni according to package instructions until al dente. Drain and set aside.",
      "3. In a large saucepan, melt butter over medium heat. Add flour and stir constantly for 1-2 minutes.",
      "4. Slowly whisk in milk and continue to stir until mixture is smooth.",
      "5. Add cheddar, Gruyere, and Parmesan cheeses to the saucepan, stirring constantly until cheese is melted and mixture is smooth.",
      "6. Add cayenne pepper, black pepper, and salt to the saucepan and stir to combine.",
      "7. Add cooked macaroni to the cheese sauce and stir until macaroni is evenly coated.",
      "8. Pour mixture into prepared baking dish and sprinkle breadcrumbs on top.",
      "9. Bake for 25-30 minutes, or until top is golden brown and crispy.",
      "10. Remove from oven and let cool for 5-10 minutes before serving."
    ],
    "rating": 4.7
  },
  {
    "id": "c4t6",
    "recipe_name": "Chicken Pot Pie",
    "category_id": 6,
    "image_link": "https://i.postimg.cc/kgN5z7ML/OIP-2.jpg",
    "ingredients": [
      "1 pound boneless, skinless chicken breasts, cut into bite-sized pieces",
      "2 cups frozen mixed vegetables (peas, carrots, green beans, corn)",
      "1/2 cup unsalted butter",
      "1/2 cup all-purpose flour",
      "1/2 teaspoon salt",
      "1/4 teaspoon black pepper",
      "1/4 teaspoon garlic powder",
      "1 3/4 cups chicken broth",
      "2/3 cup milk",
      "2 unbaked 9-inch pie crusts"
    ],
    "cooking_method": [
      "1. Preheat oven to 425°F.",
      "2. In a large skillet, cook chicken until no longer pink. Add mixed vegetables and cook for 5 more minutes.",
      "3. In a separate saucepan, melt butter over medium heat. Stir in flour, salt, black pepper, and garlic powder until well blended.",
      "4. Gradually whisk in chicken broth and milk, stirring constantly, until sauce has thickened.",
      "5. Pour sauce over chicken mixture and stir to combine.",
      "6. Line a 9-inch pie dish with one pie crust. Pour in chicken mixture. Cover with second pie crust, crimping edges to seal.",
      "7. Cut a few slits in the top crust to allow steam to escape.",
      "8. Bake for 30-35 minutes, or until crust is golden brown and filling is hot and bubbly.",
      "9. Let cool for 10 minutes before serving."
    ],
    "rating": 4.7
  }
]
